Управляемые формы 1С 8.3/Documents/ПриготовлениеПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриготовлениеПродуктов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продукты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Управляемые формы 1С 8.3/Catalogs/Продукты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Продукты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МожноПриготовить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ингредиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Управляемые формы 1С 8.3/Documents/ПриготовлениеПродуктов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаИзмененияПродукта() 
	
Если ЗначениеЗаполнено(Объект.Продукт) Тогда 	
  Если Вопрос("Табличная часть будет заполнена! Продолжить?",
		РежимДиалогаВопрос.ДаНет)= КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
КонецЕсли;    

    Если Объект.Продукты.Количество() > 0 Тогда
	Если Вопрос("Очистить табличную часть?",
		РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
		Объект.Продукты.Очистить(); 
	КонецЕсли;  
КонецЕсли;  

   Если ЗначениеЗаполнено(Объект.Продукт) Тогда
	ЗаполнитьТабЧастьПродуктыНаСервере();
КонецЕсли;

КонецПроцедуры 

//Обработчики

&НаСервере
Процедура ЗаполнитьТабЧастьПродуктыНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	            	|	ПродуктыИнгредиенты.Продукт КАК Продукт,
	             	|	ПродуктыИнгредиенты.Количество КАК Количество
	            	|ИЗ
	             	|	Справочник.Продукты.Ингредиенты КАК ПродуктыИнгредиенты
	            	|ГДЕ
		            |	ПродуктыИнгредиенты.Ссылка=&Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Продукт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
	НоваяСтрока = Объект.Продукты.Добавить();	
	НоваяСтрока.Продукт = ВыборкаДетальныеЗаписи.Продукт;	
	НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество*Объект.КоличествоПорций;	
	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабЧастьПродукты(Команда)
	
	ОбработкаИзмененияпродукта();	

КонецПроцедуры

&НаКлиенте
Процедура ПродуктПриИзменении(Элемент) 
	
ОбработкаИзмененияПродукта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабЧастьПродукты(Команда)  
	
Если Объект.Продукты.Количество() > 0 Тогда
	Если Вопрос("Очистить табличную часть?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
		Объект.Продукты.Очистить(); 
	КонецЕсли;  
КонецЕсли;    

КонецПроцедуры
